---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResultArray.Size
source: html/0cc7702e-af84-be4c-fce0-c53cccd4885a.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.Size Property

Returns the number of objects that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```